// Задание на урок
/*
1. Создать переменную numberOfFilms и в нее поместить ответ 
от пользователя на вопрос:
'Сколько фильмов вы уже посмотрели?'

2. Создать объект personalMovieDB и внего поместить такие свойства:
    - count - сюда передается ответ на первый вопрос
    - movies - в это свойство поместить пустой объект
    - actors - тоже поместить пустой объект
    - genres - сюда поместить пустой массив
    - privat - в это свойство поместить boolean(логическое) значение false

3. Задайте пользователю по два раза вопроса
    - 'Один из последних просмотренных фильмов?'
    - 'На сколько оцените его?'

Ответы стоит поместить в отдельные пременные
Записать ответы в объект movies в формате:
    movies: {
        'logan': '8.1'
    }

Проверить, чтобы все работало без ошибок
*/

const numberOfFilms = +prompt("Сколько фильмов вы уже посмотрели?", "");

const personalMovieDB = {
    count: numberOfFilms,
    movies: {},
    actors: {},
    genres: [],
    privat: false
};

const a = prompt("Один из последних просмотренных фильмов?", ""),
    b = prompt("На сколько оцените этот фильм?", ""),
    c = prompt("Один из последних просмотренных фильмов?", ""),
    d = prompt("На сколько оцените этот фильм?", "");

personalMovieDB.movies[a] = b;
personalMovieDB.movies[c] = d;

console.log(personalMovieDB);